{
    "K.OA.A.2": "Solve addition and subtraction word problems, and add and subtract within 10, e.g., by using objects or drawings to represent the problem.",
    "1.OA.A.1": "Use addition and subtraction within 20 to solve word problems involving situations of adding to, taking from, putting together, taking apart, and comparing, with unknowns in all positions.",
    "1.OA.A.2": "Solve word problems that call for addition of three whole numbers whose sum is less than or equal to 20.",
    "2.OA.A.1": "Use addition and subtraction within 100 to solve one- and two-step word problems involving situations of adding to, taking from, putting together, taking apart, and comparing, with unknowns in all positions.",
    "3.OA.A.3": "Use multiplication and division within 100 to solve word problems in situations involving equal groups, arrays, and measurement quantities.",
    "3.OA.D.8": "Solve two-step word problems using the four operations. Represent these problems using equations with a letter standing for the unknown quantity. Assess the reasonableness of answers using mental computation and estimation strategies including rounding.",
    "4.OA.A.2": "Multiply or divide to solve word problems involving multiplicative comparison",
    "4.OA.A.3": "Solve multistep word problems posed with whole numbers and having whole-number answers using the four operations, including problems in which remainders must be interpreted. Represent these problems using equations with a letter standing for the unknown quantity. Assess the reasonableness of answers using mental computation and estimation strategies including rounding.",
    "4.NF.B.3.D": "Solve word problems involving addition and subtraction of fractions referring to the same whole and having like denominators.",
    "4.NF.B.4.C": "Solve word problems involving multiplication of a fraction by a whole number.",
    "5.NF.A.2": "Solve word problems involving addition and subtraction of fractions referring to the same whole, including cases of unlike denominators, e.g., by using visual fraction models or equations to represent the problem. Use benchmark fractions and number sense of fractions to estimate mentally and assess the reasonableness of answers.",
    "5.NF.B.3": "Interpret a fraction as division of the numerator by the denominator. Solve word problems involving division of whole numbers leading to answers in the form of fractions or mixed numbers.",
    "2.MD.B.5": "Use addition and subtraction within 100 to solve word problems involving lengths that are given in the same units.",
    "2.MD.C.8": "Solve word problems involving dollar bills, quarters, dimes, nickels, and pennies, using $ and ¢ symbols appropriately.",
    "3.MD.A.1": "Tell and write time to the nearest minute and measure time intervals in minutes. Solve word problems involving addition and subtraction of time intervals in minutes.",
    "3.MD.A.2": "Measure and estimate liquid volumes and masses of objects using standard units of grams (g), kilograms (kg), and liters (l).1 Add, subtract, multiply, or divide to solve one-step word problems involving masses or volumes that are given in the same units.",
    "4.MD.A.2": "Use the four operations to solve word problems involving distances, intervals of time, liquid volumes, masses of objects, and money, including problems involving simple fractions or decimals, and problems that require expressing measurements given in a larger unit in terms of a smaller unit. Represent measurement quantities using diagrams such as number line diagrams that feature a measurement scale.",
    "6.NS.A.1": "Interpret and compute quotients of fractions, and solve word problems involving division of fractions by fractions.",
    "7.EE.B.4.A": "Solve word problems leading to equations of the form px + q = r and p(x + q) = r, where p, q, and r are specific rational numbers. Solve equations of these forms fluently. Compare an algebraic solution to an arithmetic solution, identifying the sequence of the operations used in each approach.",
    "7.EE.B.4.B": "Solve word problems leading to inequalities of the form px + q > r or px + q < r, where p, q, and r are specific rational numbers. Graph the solution set of the inequality and interpret it in the context of the problem."
}